// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.Clear();
Console.WriteLine("Программа принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.");

Console.Write("Введите день недели цифрой: ");
int a = Convert.ToInt32(Console.ReadLine());

while (a < 1 || a > 7) {
    Console.Write("Ошибка ввода. Введите день недели цифрой: ");
    a = Convert.ToInt32(Console.ReadLine());   
}


if (a == 6 || a == 7) 
    Console.WriteLine("да");
else
    Console.WriteLine("нет");